// exports.height = 155;
// exports.weight = 60;

exports.bmiCal = function(height, weight) {
    height = height / 100; // convert with cm to m
    bmi = weight / (height * height);
    result = bmi;
    if (result >= 40.0) console.log("โรคอ้วนขั้นสูงสุด");
    else if (result >= 35.0) console.log("BMI = " + result + "\nโรคอ้วนระดับ2 คุณเสี่ยงต่อการเกิดโรคที่มากับความอ้วน หากคุณมีเส้นรอบเอวมากกว่าเกณฑ์ปกติคุณจะเสี่ยงต่อการเกิดโรคสูง คุณต้องควบคุมอาหาร และออกกำลังกายอย่างจริงจัง");
    else if (result >= 28.5) console.log("BMI = " + result + "\nโรคอ้วนระดับ1 และหากคุณมีเส้นรอบเอวมากกว่า 90 ซม.(ชาย) 80 ซม.(หญิง) คุณจะมีโอกาศเกิดโรคความดัน เบาหวานสูง จำเป็นต้องควบคุมอาหาร และออกกำลังกาย");
    else if (result >= 23.5) console.log("BMI = " + result + "\nน้ำหนักเกิน หากคุณมีกรรมพันธ์เป็นโรคเบาหวานหรือไขมันในเลือดสูงต้องพยายามลดน้ำหนักให้ดัชนีมวลกายต่ำกว่า 23");
    else if (result >= 18.5) console.log("BMI = " + result + "\nน้ำหนักปกติ และมีปริมาณไขมันอยู่ในเกณฑ์ปกติ มักจะไม่ค่อยมีโรคร้าย อุบัติการณ์ของโรคเบาหวาน ความดันโลหิตสูงต่ำกว่าผู้ที่อ้วนกว่านี้");
    else if (result < 18.5 ) console.log("BMI = " + result + "\nน้ำหนักน้อยเกินไป ซึ่งอาจจะเกิดจากนักกีฬาที่ออกกำลังกายมาก และได้รับสารอาหารไม่เพียงพอ วิธีแก้ไขต้องรับประทานอาหารที่มีคุณภาพ และมีปริมาณพลังงานเพียงพอ และออกกำลังกายอย่างเหมาะสม");
    else console.log("โปรดใส่น้ำหนักที่ถูกต้อง");
}

